{
  "homepage": "http://www.curse.com/mc-mods/minecraft/238253-pokecube-core",
  "promos": {
    "1.8.8-latest": "2.1.4",
    "1.8.8-recommended": "2.1.4",
    "1.8.9-latest": "2.2.5",
    "1.8.9-recommended": "2.2.5"
  },
  "1.8.9": {
    "2.2.5": "Fixes the lots and lots of zubats.",
    "2.2.4": "Misc fixed and tweaks, see MCF thread changelog for full list.",
    "2.2.3": "Hopefully fixes some CMEs, also updates pt_BR translations",
    "2.1.19": "Fixes a rendering issue with some x3d models.",
    "2.1.15": "Fixes a crash from breeding.",
    "2.1.11": "Misc fixes.",
    "2.1.6": "fixes some mega evolution issues.",
    "2.1.0": "initial 1.8.9 port"
  },
  "1.8.8": {
    "2.0.31": "Fixes Server crash, Fixes server issue with pokemobs having different model on client sometimes, Overhaul of ability system.",
    "2.0.30": "Fixes shading and lighting issues with x3d models.",
    "2.0.29": "More Improvements to animations, improvements to Animation GUI, tweaks to x3d renderer.",
    "2.0.28": "Fixes crash from using F to command an attack, Improvements to animations, cleaned up some texture warnings.",
    "2.0.27": "Overhaul of the x3d model loading system, extended that and the tabula system to allow support for multiple textures per model.",
    "2.0.26": "Texture info for pokemobs is now registered in the XML, rather than database.  See charizard, combee and pikachu for examples.",
    "2.0.25": "Re-adds ability to load from a sub-mod instead of just from resource packs.  Adds some internal events.",
    "2.0.24": "Adds gather and storage AI, fixes some gui issues with shaders. See GitHub for full list of changes.",
    "2.0.23": "fixes some lag issues with smokescreen, fixes some issues with statscollector, needed to enable some of the stuff for WAILA compat",
    "2.0.22": "improvements to animation system. Baubles has been removed, as the 1.8 version works with 1.8.8. Backend AI changes",
    "2.0.21": "fixes the override database config not actually working.",
    "2.0.20": "added a config to allow other resource packs to be treated like Pokecube_Resources for adding pokemobs, see the Gen_<num> packs on the Github for examples.",
    "2.0.19": "initial support for custom shearable parts, as well as custom dyeable parts,  Re-adds the hiss before pokemobs explode.",
    "2.0.18": "updates to ThutCore 2.1.9, should improve on some types of pathfinding, also improves on some of the animation capabilities for pokemobs.",
    "2.0.17": "updates to ThutCore 2.1.8, should improve on some aspects of sub-biome allocation and detection.",
    "2.0.16": "fixes some gui issues, some minor optimizations to AI, fixes dispensers, berries are not food anymore.",
    "2.0.15": "fixes a server issue with logging out",
    "2.0.14": "bunch of network optimizations, fixes berry crops not growing naturally, fixes a SMP kick for trading, fixes teleport not teleporting wild pokemobs",
    "2.0.13": "Fixes lag from pokemobs in GUI, fixes the remaining server/client sync issues, Fixes solosis line, requires re-downloading the Pokecube_Resources.zip from GitHub",
    "2.0.12": "Improves Animation Loading support, models can be partially animated in tabula, and in the xml via presets, and have them combined",
    "2.0.11": "Updates to Thut Core 2.1.6",
    "2.0.10": "fixes the long standing sync issues with client and server which would result in teleporty pokemobs",
    "2.0.9": "Updates the version checker, fixes combee and charizard not loading from resource pack",
    "2.0.8": "fixes missing berry block textures, a pokecube dupe bug, adds configurable interaction capabilities",
    "2.0.7": "fixes invisible pokemobs on servers",
    "2.0.6": "modified the custom trader entity, it now sells things the villager used to",
    "2.0.5": "fixes nicknaming issue",
    "2.0.4": "added fossils to core",
    "2.0.3": "fixes a crash from village buildings, fixes village buildings",
    "2.0.2": "fixes a crash from removing pokemobs",
    "2.0.1": "added forge based version checking, changed how eggs work",
    "2.0.0": "initial 1.8.8 version"
  }
}
